Tekla Open API Reference for Tekla Structures 2025
View.ShorteningCutPartType Enumeration
 The vertical label position types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ShorteningCutPartType
Public Enumeration ShorteningCutPartType
Members
Member name | Value | Description
BothDirections | 1 |  The shortening is done to both x and y directions.
X_Direction | 2 |  The shortening is done only to x direction.
Y_Direction | 3 |  The shortening is done only to y direction.
See Also
Reference
Tekla.Structures.Drawing Namespace